applications/not_working/lagrangian_solvers_from_internet/myPLTpimpleFoam/test_myPLTLpimpleFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (0.0 0.0 0.0)
    (1.0 0.0 0.0)
    (1.0 1.0 0.0)
    (0.0 1.0 0.0)
    (0.0 0.0 1.0)
    (1.0 0.0 1.0)
    (1.0 1.0 1.0)
    (0.0 1.0 1.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)(20 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (0 1 5 4)
            (0 3 2 1)
            (1 2 6 5)
            (4 5 6 7)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
