applications/not_working/lagrangian_solvers_from_internet/myPLTpimpleFoam/test_myPLTLpimpleFoam/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


(
(3.700000e-01 0.5 5.800000e-01)
(3.700000e-01 0.5 5.900000e-01)
(3.700000e-01 0.5 6.000000e-01)
(3.700000e-01 0.5 6.100000e-01)
(3.700000e-01 0.5 6.200000e-01)
(3.700000e-01 0.5 6.300000e-01)
(3.700000e-01 0.5 6.400000e-01)
(3.700000e-01 0.5 6.500000e-01)
(3.700000e-01 0.5 6.600000e-01)
(3.700000e-01 0.5 6.700000e-01)
(3.700000e-01 0.5 6.800000e-01)
(3.700000e-01 0.5 6.900000e-01)
(3.700000e-01 0.5 7.000000e-01)
(3.700000e-01 0.5 7.100000e-01)
(3.700000e-01 0.5 7.200000e-01)
(3.700000e-01 0.5 7.300000e-01)
(3.700000e-01 0.5 7.400000e-01)
(3.700000e-01 0.5 7.500000e-01)
(3.700000e-01 0.5 7.600000e-01)
(3.700000e-01 0.5 7.700000e-01)
(3.700000e-01 0.5 7.800000e-01)
(3.700000e-01 0.5 7.900000e-01)
(3.700000e-01 0.5 8.000000e-01)
(3.700000e-01 0.5 8.100000e-01)
(3.700000e-01 0.5 8.200000e-01)
(3.700000e-01 0.5 8.300000e-01)
(3.700000e-01 0.5 8.400000e-01)
(3.700000e-01 0.5 8.500000e-01)
(3.700000e-01 0.5 8.600000e-01)
(3.700000e-01 0.5 8.700000e-01)
(3.700000e-01 0.5 8.800000e-01)
(3.700000e-01 0.5 8.900000e-01)
(3.700000e-01 0.5 9.000000e-01)
(3.700000e-01 0.5 9.100000e-01)
(3.700000e-01 0.5 9.200000e-01)
(3.700000e-01 0.5 9.300000e-01)
(3.700000e-01 0.5 9.400000e-01)
(3.700000e-01 0.5 9.500000e-01)
(3.800000e-01 0.5 5.000000e-02)
(3.800000e-01 0.5 6.000000e-02)
(3.800000e-01 0.5 7.000000e-02)
(3.800000e-01 0.5 8.000000e-02)
(3.800000e-01 0.5 9.000000e-02)
(3.800000e-01 0.5 1.000000e-01)
(3.800000e-01 0.5 1.100000e-01)
(3.800000e-01 0.5 1.200000e-01)
(3.800000e-01 0.5 1.300000e-01)
(3.800000e-01 0.5 1.400000e-01)
(3.800000e-01 0.5 1.500000e-01)
(3.800000e-01 0.5 1.600000e-01)
(3.800000e-01 0.5 1.700000e-01)
(3.800000e-01 0.5 1.800000e-01)
(3.800000e-01 0.5 1.900000e-01)
(3.800000e-01 0.5 2.000000e-01)
(3.800000e-01 0.5 2.100000e-01)
(3.800000e-01 0.5 2.200000e-01)
(3.800000e-01 0.5 2.300000e-01)
(3.800000e-01 0.5 2.400000e-01)
(3.800000e-01 0.5 2.500000e-01)
(3.800000e-01 0.5 2.600000e-01)
(3.800000e-01 0.5 2.700000e-01)
(3.800000e-01 0.5 2.800000e-01)
(3.800000e-01 0.5 2.900000e-01)
(3.800000e-01 0.5 3.000000e-01)
(3.800000e-01 0.5 3.100000e-01)
(3.800000e-01 0.5 3.200000e-01)
(3.800000e-01 0.5 3.300000e-01)
(3.800000e-01 0.5 3.400000e-01)
(3.800000e-01 0.5 3.500000e-01)
(3.800000e-01 0.5 3.600000e-01)
(3.800000e-01 0.5 3.700000e-01)
(3.800000e-01 0.5 3.800000e-01)
(3.800000e-01 0.5 3.900000e-01)
(3.800000e-01 0.5 4.000000e-01)
(3.800000e-01 0.5 4.100000e-01)
(3.800000e-01 0.5 4.200000e-01)
(3.800000e-01 0.5 4.300000e-01)
(3.800000e-01 0.5 4.400000e-01)
(3.800000e-01 0.5 4.500000e-01)
(3.800000e-01 0.5 4.600000e-01)
(3.800000e-01 0.5 4.700000e-01)
(3.800000e-01 0.5 4.800000e-01)
(3.800000e-01 0.5 4.900000e-01)
(3.800000e-01 0.5 5.000000e-01)
(3.800000e-01 0.5 5.100000e-01)
(3.800000e-01 0.5 5.200000e-01)
(3.800000e-01 0.5 5.300000e-01)
(3.800000e-01 0.5 5.400000e-01)
(3.800000e-01 0.5 5.500000e-01)
(3.800000e-01 0.5 5.600000e-01)
(3.800000e-01 0.5 5.700000e-01)
(3.800000e-01 0.5 5.800000e-01)
(3.800000e-01 0.5 5.900000e-01)
(3.800000e-01 0.5 6.000000e-01)
(3.800000e-01 0.5 6.100000e-01)
(3.800000e-01 0.5 6.200000e-01)
(3.800000e-01 0.5 6.300000e-01)
(3.800000e-01 0.5 6.400000e-01)
(3.800000e-01 0.5 6.500000e-01)
...
)

// ************************************************************************* //
